Revit 2027 API
ParameterTypeId.AnalyticalModelFoundationsMark Property
 "Foundation Number": Used for isolated, wall foundations
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalModelFoundationsMark { get; }
Public Shared ReadOnly Property AnalyticalModelFoundationsMark As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalModelFoundationsMark {
	ForgeTypeId^ get ();
}
static member AnalyticalModelFoundationsMark : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace